---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
RenderingQualitySettings Properties
RenderingQualitySettings Class See Also Send Feedback
---

The RenderingQualitySettings type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | LightAndMaterialAccuracyMode | A value that controls light and material accuracy mode. |
|  | RenderDuration | A value that controls render duration. |
|  | RenderingQuality | The quality applied for rendering. |
|  | RenderLevel | The render target level as a numerical value between 1 and 40. |
|  | RenderTime | The render target time as a numerical value between 1 and 32768. |

# See Also

RenderingQualitySettings Class

Autodesk.Revit.DB Namespace